app/Controllers/herramientasController.php

    public function herramientas(){

        $herramienta = new Herramienta();
        $data['herramientas'] = $herramienta->orderBy('id', 'ASC')->findAll();
---
SELECT *
FROM `herramienta`
ORDER BY `id` ASC