app/Controllers/productoController.php

    public function productos(){

        $producto = new Producto();
        $data['productos'] = $producto->orderBy('id', 'ASC')->findAll();
---
SELECT *
FROM `producto`
ORDER BY `id` ASC

    public function borrar($id=null){

        $producto= new Producto();
        $dataProducto=$producto->where('id',$id)->first();
---
SELECT *
FROM `producto`
WHERE `id` = '8'
 LIMIT 1