app/Controllers/proyectoController.php

    public function proyectos(){

        $proyecto = new ProyectoModel();
        $data['proyectos'] = $proyecto->orderBy('id', 'ASC')->findAll();
---
SELECT *
FROM `proyecto`
ORDER BY `id` ASC

    public function guardar_proyecto(){

        $proyecto= new ProyectoModel();

        $data=[
            'nombre_proyecto'=>$this->request->getPost('nombre_proyecto'),
            'fecha_inicio'=>$this->request->getPost('fecha_inicio'),
            'fecha_entrega'=>$this->request->getPost('fecha_entrega')
        ];

        $proyecto->insert($data);
---
INSERT INTO `proyecto` (`nombre_proyecto`, `fecha_inicio`, `fecha_entrega`) VALUES ('hola actualizar 2', '2022-07-14', '2022-07-16')

    public function editar_proyecto($id=null){


        print_r($id);
        return view('Proyectos/crud_proyectos');

        $proyecto= new ProyectoModel();

        $dataproyecto=$proyecto->where('id',$id)->first();
---
SELECT *
FROM `proyecto`
WHERE `id` = '17'
 LIMIT 1